
stopwords = ['ΓΙΑ', 'ΓΙΑ', 'ΚΑΙ', 'ΣΤH', 'ΣTH', 'ΣΕ', 'ΜΕ', 'ΣΤΑ', 'ΣΤΗ', 'ΣΤΗΝ', 'ΣΤΙHN', 'ΣΤΙΣ', 'ΣΤΟ', 'ΤΗ', 'ΤΗΣ', 'ΤΟΥΣ', 'ΕΙΝΑΙ', 'ΕΝΑ', 'ΕΧΕΙ', 
             'ΣΤΟΝ', 'ΤΗΝ', 'ΤΙΣ', 'ΤΟ', 'ΤΟΥ', 'ΤΩΝ']


words_to_delete = ['1' ,'10' ,"12''", '1Ο' ,'1ΟΥ' ,'2' ,'2ΗΣ' ,'2ΟΥ' ,'3' ,'3/4"' ,'380V' ,'4' ,'4"' ,'4ΗΣ' ,'5' ,'6' ,'6KG' ,'8ΡΙΟΥ' ,'B.' ,'B/ΕΛ.' ,
                   'C.' ,'DP' ,'F.' ,'L.' ,'LI' ,'M' ,'O.' ,'P.' ,'S2' ,'T' ,'W.' ,'Β' ,'Δ','Η' ,'Κ' ,'ΝΟ1' ,'ΝΟ2' ,'ΝΟ3' ,'ΡΙ']


mapping_list = {
    'ΣΑΛΑΜΑΣΤΡΑ': ['ΣΑΛΑΜ\.', 'ΣΑΛ/ΡΑΣ', 'ΣΑΛ/ΣΤΡΑ', 'ΣΑΛ/ΣΤΡΑΣ', 'ΣΑΛ/ΣΤΡΕΣ', 'ΣΑΛ/ΣΤΡΩΝ', 'ΣΑΛΑΜΑΣΤ\.', 'ΣΑΛΑΜΑΣΤΡ\.',
                   'ΣΑΛΑΜΑΣΤΡ', 'ΣΑΛΑΜΑΣΤΡΑΣ', 'ΣΑΛΑΜΑΣΤΑΣ', 'ΣΑΛΑΜΑΣΤΡΩΝ', 'ΣΑΛΜΑΣΤΡΑΣ'],

    'ΚΑΤΑΣΚΕΥΗ': ['ΚΑΤΑΣΚ', 'ΚΑΤΑΣΚΕΥΉ', 'ΚΑΤΑΣΚ\.'],

    'ΑΝΤΙΚΑΤΑΣΤΑΣΗ': ['ANT\.', 'ΑΝΤ/ΑΣΤΑΣΗ', 'AΝΤ/ΣΗ', 'AΝΤ\.', 'ANT/ΣΗ', 'ΑΝΤ/ΣΗ', 'ΑΝΤΙΚΑΤ/ΣΗ', 'ΑΝΤΙΚΑΤ\.', '/ΑΝΤ/ΣΗ', '/ΑΝΤΙΚ\.',
                      '/ΑΝΤΙΚΑΤΑΣΤΑΣΗ', 'ΑΝΤ\.', 'ΑΝΤΙΚ/ΣΗ', 'ΑΝΤ/ΣΤΑΣΗ', 'ΑΝΤΙΚ', 'ΑΝΤΙΚ\.', 'ΑΝΤΙΚΑΤΑΣΤΑΣΗ',
                      'ΑΝΤΙΚΑΤΑ/ΣΗ', 'AΝΤΙΚ/ΣΗ', '/ΑΝΤΙΚΑΤΑΣΤΑΣΗ'],

    'ΕΛΕΓΧΟΣ': ['EΛΕΓΧ\.', '/ΕΛΕΓΧ\.', 'EΛ/ΧΟΣ', '/ΕΛΕΓΧΟΣ', 'Α/ΕΛΕΓΧΟΣ', 'ΕΛ/ΧΟΣ', 'ΕΛΕΓΧ\.', 'ΕΛ\.', 'ΕΛΕΓΧΟ'],

    'ACCUMULATOR': ['ACCUMULATOR'],

    'ΑΝΥΨΩΤΙΚΑ': ['ΑΝΥΨΩΤΙΚ', 'ΑΝΥΨΩΤIKOY', 'ΑΝΥΨΩΤIKΩΝ'],

    'ΑΠΟΚΑΤΑΣΤΑΣΗ': ['AΠΟΚ.', 'AΠ/ΣΗ', 'ΑΠ/ΣΗ', 'AΠΟΚ/ΣΗ', 'ΑΠΟΚ\.', 'ΑΠΟΚ/ΣΗ', 'ΑΠ/ΤΑΣΗ', 'ΑΠΟΚ/ΑΣΗ', 'ΑΠΟΚ/ΣΤΑΣΗ', 'ΑΠΟΚ/ΤΑΣΗ', 'ΑΠΟΚΑΤ',
                     'ΑΠΟΚΑΤ\.', 'ΑΠΟΚΑΤ/ΣΗ', 'ΑΠΟΚΑΤΑΣΤ'],

    'ΒΑΝΑΣ': ['ΒΑΝΑ', 'ΒΑΝΑΚΙ', 'ΒΑΝΩΝ'],

    'CHECK': ['CHEK', 'GCHEK'],

    'DAMPENING': ['DAMPENER'],

    'DIESEL': ['DISEL'],
    
    'SEAL': ['ΣΗΛ'],
    
    'POT': ['ΠΟΤ'],

    'DRAIN': ['DRAIN', 'ΝΤΡΕΙΝ'],

    'ΕΞΑΡΜΩΣΗ': ['ΕΞAΡΜΟΣΗ', 'ΕΞΑΡΜOΣΗ', 'ΕΞΑΡΜ', 'ΕΞΑΡΜ\.', 'ΕΞΑΡΜΟΣΗ', 'ΕΞ/ΣΗ', 'ΕΞΑΡ/ΣΗ', 'EΞAΡΜΟΣΗ', 'EΞΑΡΜ', 'EΞΑΡΜ.', 'EΞΑΡΜΟΣΗ'],

    'ΚΑΘΑΡΙΣΜΟΣ': ['ΚΑΘ/ΣΜΟΣ', 'ΚΑΘ/ΣΜΌΣ', 'ΚΑΘ', 'ΚΑΘ\.', 'ΚΑΘ/ΜΟΣ', 'ΚΑΘ/ΣΜΌ', 'ΚΑΘ/ΣΜΟΣ', 'ΚΑΘΑΡ\.',
                   'ΚΑΘΑΡΙΣΜΟΙ'],

    'ΕΛΑΧΙΣΤΗΣ': ['MINIMUM', 'MIN\.', 'ΜΙΝ\.'],

    'ΠΥΡΑΣΦΑΛΕΙΑ' : ['ΠΥΡΑΣΦΑΛ\.'],

    'PULSATION': ['PULSAT\.'],

    'SPOOL': ['SPOOLS'],

    'STROKE': ['STROKES'],

    'ΤΟΠΟΘΕΤΗΣΗ': ['ΤΟΠ\.', 'ΤΟΠ/ΟΘΕΤΗΣΗ', 'ΤΟΠ/ΣΗ', 'ΤΟΠ/ΤΗΣΗ', 'ΤΟΠΟΘ\.', 'ΤΟΠΟΘ/ΣΗ','/ΤΟΠΟΘΕΤΗΣΗ', 'ΤΟΠΟΘ/ΣΗ', 'ΤΟΠ/ΤΗΣΗ'],

    'ΑΡΜΩΣΗ': ['ΑΡΜOΣΗ', 'ΑΡΜΟΣΗ', 'ΑΡΜ\.', 'ΑΡ/ΣΗ', 'ΑΡΜ', 'ΑΡΜ\.'],

    'ΑΕΡΟΚΩΔΩΝΑ': ['ΑΕΡΟΚΟΔ', 'ΑΕΡΟΚΟΔΟΝΑ'],

    'ΑΛΥΣΙΔΑΣ': ['ΑΛΥΣΙΔΩΝ', 'ΑΛΥΣΙΔΩΤΗ'],

    'ΑΝΑΡΡΟΦΗΣΗΣ': ['ΑΝ/ΣΗ', 'ΑΝ/ΣΗΣ', 'ΑΝ/ΦΗΣΗ', 'ΑΝΑΡ\.', 'ΑΝΑΡ/ΣΗ', 'ΑΝΑΡ/ΣΗΣ', 'ΑΝΑΡΟΦΗΣΗΣ', 'ΑΝΑΡΡ', 'ΑΝΑΡΡ\.',
                    'ΑΝΑΡΡ/ΣΗΣ', 'ΑΝΑΡΡΟΦ\.'],

    'ΑΝΤΛΙΑ': ['ΑΝΛΙΑΣ', 'ΑΝΤΛ', 'ΑΝΤΛ\.', 'ΑΝΤΛΙΑΣ', 'ΑΝΤΛΙΩΝ', 'ΑΝΤΛΙΑΣ\(ΔΕΝ', 'ΑΝΤΛΙΑΣ\.'],

    'ΑΝΤΛΙΟΣΤΑΣΙΟΥ': ['ΑΝΤΛ/ΣΙΟΥ'],

    'ΑΝΥΨΩΤΙΚΩΝ': ['ΑΝΤΨΩΤΙΚΟΥ', 'ΑΝΥΨΩΤ\.', 'ΑΝΥΨΩΤΙΚΟΥ', 'ΑΝΥΨΩΤΙΚ\.', 'ΑΝΥΨΩΤΙΚΑ', 'AΝΥΨΩΤΙΚ'],

    'ΑΞΟΝΑ': ['ΑΞΟΝΑ'],

    'ΑΠΟΔΟΣΗ': ['ΑΠΌΔΟΣΗ', 'ΑΠΟ', 'ΑΠΟΔ\.', 'ΑΠΟΔΟΣΗ', 'ΑΠΟΔΟΣΗΣ'],

    'ΑΠΟΜΟΝΩΣΗΣ': ['ΑΠΟΜ\.', 'ΑΠΟΜΟΝ', 'ΑΠΟΜΟΝ\.'],
    'ΑΠΟΣΥΝΔΕΣΗ': ['ΑΠΟΣ/ΣΗ', 'ΑΠΟΣΥΝΔ\.', 'ΑΠΟΣΥΝΕΔΣΗ'],

    'ΑΡΜΩΣΗ/ΕΞΑΡΜΩΣΗ': ['ΑΡΜΟΣΗ/ΕΞΑΡΜΟΣΗ'],

    'ΑΣΦΑΛΙΣΤΙΚΩΝ': ['ΑΣΦΑΛΙΣΤΙΚΟ', 'ΑΣΦΑΛΙΣΤΙΚΟΥ'],

    'ΑΦΑΙΡΕΣΗ': ['ΑΦΑΙΡ\.'],

    'ΒΙΔΑΣ': ['ΒΙΔΩΝ'],

    'ΓΡΑΜΜΗΣ': ['ΓΡ\.', 'ΓΡΑΜΜ', 'ΓΡΑΜΜ\.', 'ΓΡΑΜΜΕΣ', 'ΓΡΑΜΜΩΝ'],

    'ΓΡΑΝΑΖΙΩΝ': ['ΓΡΑΝ', 'ΓΡΑΝ\.'],

    'ΓΡΑΣΑΡΙΣΜΑ': ['ΓΡΑΣ/ΜΑ', 'ΓΡΑΣΣΑΡΙΣΜΑ'],

    'ΔΑΧΤΥΛΙΔΙΩΝ': ['ΔΑΧ', 'ΔΑΧΤ\.', 'ΔΑΧΤΥΛ\.', 'ΔΑΧΤΥΛΙΔΙΟΥ'],

    'ΔΙΑΘΕΣΗ': ['ΔΙΆΘΕΣΗ', 'ΔΙΑΘΣΗ'],

    'ΔΙΑΚΕΝΩΝ': ['ΔΙΑΚ\.', 'ΔΙΑΚΕΝ\.'],
    
    'ΡΟΗΣ': ['FLOW'],

    'ΔΙΑΡΡΟΗ': ['ΔΙΑΡ\.', 'ΔΙΑΡΟΗ', 'ΔΙΑΡΟΗΣ', 'ΔΙΑΡΡ', 'ΔΙΑΡΡ\.', 'ΔΙΑΡΡΟΗΣ', 'ΔΙΑΡΡΟΩΝ', 'ΙΑΡΡ.'],

    'ΕΒΔΟΜΑΔΙΑΙΩΣ': ['ΕΒΔΟΜ\.'],

    'ΕΔΡΑΝΟ': ['ΕΔΡΑΝΟΥ', 'ΕΔΡΑΝΩΝ', ],

    'ΕΛΑΙΟΔΟΧΕΙΟΥ': ['ΕΛ/ΧΕΙΟΥ'],

    'ΕΛΑΙΟΔΕΞΑΜΕΝΗΣ': ['ΕΛΑΙΟΔΕΞΑΜΕΝΗ'],

    'ΕΜΒΟΛΟΥ': ['ΕΜΒΟΛΩΝ'],

    'ΕΞΙΣΟΡΡΟΠΗΣΗΣ': ['ΕΞΙΣΟΡΟΠΗΣΗΣ'],

    'ΕΞΩΤΕΡΙΚΗΣ': ['ΕΞΩ', 'ΕΞΩΤ', 'ΕΞΩΤ\.', 'ΕΞΩΤ/ΚΗΣ', 'ΕΞΩΤΕΡΙΚ\.', 'ΕΞΩΤΕΡΙΚΗ'],

    'ΕΠΙΣΚΕΥΗ': ['ΕΠ/ΚΕΥΗ', 'ΕΠ/ΥΗ', 'ΕΠΙΣΚ', 'ΕΠΙΣΚ\.'],

    'ΕΠΑΝΑΣΥΝΔΕΣΗ': ['ΕΠΑΝΑΣΥΝΔ'],

    'ΕΡΓΑΣΙΕΣ': ['ΕΡΓΑΣΙΩΝ'],

    'ΕΣΩΤΕΡΙΚΗΣ': ['ΕΣΩΤ\.', 'ΕΣΩΤΕΡ\.'],

    'ΕΥΘΥΓΡΑΜΜΙΣΗ': ['ΕΥΘ/ΜΙΣΗ', 'ΕΥΘ/ΣΗ', 'ΕΥΘΕΙΓΡΑΜΜΙΣΗ', 'ΕΥΘΗΓΡΑΜΜΙΣΗ', 'ΕΥΘΥΓΡ', 'ΕΥΘΥΓΡ\.', 'ΕΥΘΥΓΡΑΜ\.',
                     'ΕΥΘΥΓΡΑΜΜ', 'ΕΥΘΥΓΡΑΜΜ\.', 'ΕΥΘΥΓΡΑΜΜΙΣΗΣ'],

    'ΖΥΓΟΣΤΑΘΜΙΣΗ': ['ΖΥΓΟΣΤΑΘΜ\.', '/ΖΥΓΟΣΤΑΘΜΙΣΗ'],

    'ΗΛΕΚΤΡΟΣΥΓΚΟΛΛΗΣΗ': ['ΗΛΕΚΤΡ/ΣΗ', 'ΗΛΕΚΤΡΟΣΥΓΚΟΛ', 'Η/Σ', 'Η/Σ\.'],

    'ΗΛΕΚΤΡΟΛΟΓΙΚΟΣ': ['ΗΛ/ΚΗ', 'ΗΛΕΚ/ΚΗ', 'ΗΛΕΚΤΡ\.', 'HΛΕΚΤΡ/ΚΟΣ'],

    'ΙΚΡΙΩΜΑΤΑ': ['ΙΚΡ\.', 'ΙΙΚΡΙΩΜΑΤΩΝ', 'ΙΚΡΙΩΜ\.'],

    'ΙΜΑΝΤΑ': ['ΙΜΑΝΤΑΣ'],

    'ΚΑΘΡΕΠΤΗΣ': ['ΚΑΘΡΕΠΤΗ', 'ΚΑΘΡΕΠΤΤΗ'],

    'ΚΑΛΩΔΙΟΥ': ['ΚΑΛΩΔ\.'],

    'ΚΑΤΑΘΛΙΨΗΣ': ['ΚΑΤ', 'ΚΑΤ\.', 'ΚΑΤ/ΨΗΣ', 'ΚΑΤΑΘΛ', 'ΚΑΤΑΘΛ\.', 'ΚΑΤΑΘΛΙΨΗ'],

    'ΚΑΤΑΣΤΑΣΗΣ': ['ΚΑΤΑΣΤ\.'],

    'ΚΟΜΠΛΕΡ': ['ΚΟΜΠΛ'],

    'ΚΟΝΤΗΜΑ': ['ΚΟΝΤΥΜΑ'],

    'ΚΥΚΛΩΜΑ': ['ΚΥΚΛΩΜ'],

    'ΛΙΠΑΝΣΗΣ': ['ΛΙΠΑΝΣ\.'],

    'ΛΙΠΑΝΤΙΚΑ': ['ΛΙΠΑΝΤ', 'ΛΙΠΑΝΤ\.', 'ΛΙΠΑΝΤΗΡΑ', 'ΛΙΠΑΝΤΙΚ\.', 'ΛΙΠΑΝΤΙΚΟΥ', 'ΛΙΠΑΝΤΙΚΩΝ', 'ΛΑΔΙΟΥ', 'ΛΑΔΙΚΟΥ', 'ΛΑΔΙΩΝ'],

    'ΜΑΝΟΜΕΤΡΟΥ': ['ΜΑΝΟΜΕΤΡΟΥ'],

    'ΜΑΣΤΟΥ': ['ΜΑΣΤΟ'],

    'ΜΕΙΩΜΕΝΗ': ['ΜΕΙΩΜΕΝΗΣ', 'ΜΕΙΩΜ\.'],

    'ΜΕΤΑΦΟΡΑ': ['ΜΕΤ\.', 'ΜΕΤ/ΡΑ'],

    'ΜΗΧΑΝΗΜΑΤΟΣ': ['ΜΗΧΑΝ\.', 'ΜΗΧΑΝΗΜ\.', 'ΜΗΧΑΝΗΣ', 'ΜΗΧΑΝHM\.'],
    
    'ΜΗΧΑΝΙΣΜΟΣ': ['ΜΗΧΑΝΙΣΜΩΝ', 'ΜΗΧΑΝΙΣΜΟΥ'],
    
    'ΜΗΧΑΝΙΚΗΣ': ['ΜΗΧΑΝΙΚΩΝ'], 

    'ΜΗΧΑΝΟΛΟΓΙΚΟΣ': ['ΜΗΧΑΝΟΛ\.'],

    'ΜΟΝΩΣΕΩΝ': ['ΜΟΝΟΣΕΩΝ', 'ΜΟΝΩΣΗΣ'],

    'ΜΟΝΑΔΑΣ': ['ΜΟΝΑΔΟΣ'],

    'ΝΕΟΥ': ['ΝΕΑΣ'],

    'ΟΠΤΙΚΟΣ': ['ΟΠΤΙΚ\.'],

    'ΠΑΠΑΓΑΛΟΥ': ['ΠΑΠΑΓ\.'],

    'ΠΙΕΣΗ': ['ΠΙΕΣΗΣ'],

    'ΠΟΛΛΑΠΛΑΣΙΑΣΤΗ': ['ΠΟΛ/ΤΗ', 'ΠΟΛΛΑΠ', 'ΠΟΛ/ΤΗ', 'ΠΟΛΛΑΠ'],

    'ΠΟΤΗΡΙΟΥ': ['ΠΟΤΗΡΑΚΙ'],

    'ΠΡΟΘΕΡΜΑΝΣΗΣ': ['ΠΡΟΘΕΡΜ', 'ΠΡΟΘΕΡΜΑΝ', 'ΠΡΟΘΕΡΜΑΝ\.'],

    'ΠΡΟΣΘΗΚΗ': ['ΠΡΟΣΘ\.'],

    'ΠΡΟΣΤΑΤΕΥΤΙΚΩΝ': ['ΠΡΟΣΤ/ΚΩΝ', 'ΠΡΟΣΤΑΤΕΥΤΙΚΟΥ'],

    'ΡΟΥΛΕΜΑΝ': ['ΡΟΥΛ\.', 'ΡΟΥΛΕΜ\.'],

    'ΡΥΘΜΙΣΤΩΝ': ['ΡΥΘΜ\.', 'ΡΥΘΜΙΣΤΗ', 'ΡΥΘΜΙΣΤΙΚΗΣ', 'ΡΥΘΜΙΣΤΙΚΟΥ'],

    'ΣΥΝΔΕΣΗ': ['ΣΥΝΔ\.', 'ΚΟΝΕΞΙΟΝ'],

    'ΣΚΑΛΩΣΙΑ': ['ΣΚΑΛΩΣΙΑΣ', 'ΣΚΑΛΩΣΙΕΣ', 'ΣΚΑΛΩΣΙΩΝ'],

    'ΣΠΑΣΜΕΝΟ': ['ΣΠΑΣΜΕΝΟΥ'],

    'ΣΤΕΓΑΝΟΠΟΙΗΣΗ': ['ΣΤΕΓΑΝΟΠΟΙΣΗ'],

    'ΣΤΟΙΧΕΙΟ': ['ΣΤΟΙΧ\.', 'ΣΤΟΙΧΕΙΟΥ', 'ΣΤΟΙΧΕΙΩΝ'],
    
    'ΣΤΡΟΦΕΙΟΥ': ['ΣΤΡΟΦ\.'],
    
    'ΣΥΜΠΛΗΡΩΜΑ': ['ΣΥΜΠΛΗΡ\.'],

    'ΣΥΣΤΗΜΑΤΟΣ': ['ΣΥΣΤ', 'ΣΥΣΤΗΜ\.'],

    'ΣΥΣΦΙΞΗ': ['ΣΥΣΦΙΓΞΗ'],

    'ΣΩΛΗΝΑ': ['ΣΩΛΗΝΑΚΙ', 'ΣΩΛΗΝΑΚΙΑ', 'ΣΩΛΗΝΙΣΚΟΥ', 'ΣΩΛΗΝΩΝ'],

    'ΣΩΜΑ': ['ΣΩΜΑΤΟΣ'],
    
    'ΠΡΟΛΗΠΤΙΚΟΣ': ['ΠΡΟΛΗΠΤ.'],
    
    'ΤΕΡΜΑΤΙΚΩΝ': ['ΤΕΡΜΑΤΙΚΟΥ', 'ΤΕΡΜΑΤ', 'ΤΕΡΜ\.'],

    'ΤΜΗΜΑΤΟΣ': ['ΤΜΗΜ\.'],

    'ΤΥΦΛΩΝ': ['ΤΥΦΛΟΥ', 'ΤΥΦΛΑ', 'ΥΦΛΩΝ', 'ΤΥΦΛOΥ'],

    'ΥΔΡΑΥΛΙΚΗ': ['ΥΔΑΡΑΥΛΙΚΗ'],

    'ΦΙΛΤΡΩΝ': ['ΦΙΛΤΡ\.', 'ΦΙΛΤΡΟΥ', 'ΦΙΛΤΡOY', 'ΦΙΛΤΡΑ', 'ΦΙΛΤΡΟ'],

    'ΦΛΑΝΤΖΑΣ': ['ΦΛΑΤΖΑΣ', 'ΦΛΑΝΤΖΑ', 'ΦΛΑΝΤΖΩΝ'],

    'ΧΗΜΙΚΟΣ': ['ΧΗΜΙΚ\.'],

    'ΨΥΓΕΙΩΝ': ['ΨΥΓΕΙΟΥ'],
    
    'ΜΕΤΡΗΣΗ ΚΡΑΔΑΣΜΩΝ ΕΞΟΠΛΙΣΜΟΥ': ['ΕΡΓΟΛ\. ΠΡΟΣ\. ΜΕΤΡΗΣΗ ΚΡΑΔΑΣΜΩΝ ΕΞΟΠΛΙΣΜΟΥ'],
    
    'EMERGENCY': ['EMERG\.'],
    }
